const navigation = {
    about: [
        { name: 'Our Policy', href: '#' },
        { name: 'News', href: '#' },
        { name: 'Commerce', href: '#' },
    ],
    promotions: [
        { name: 'Campaings', href: '#' },
        { name: 'Bonus Card', href: '#' },
        { name: 'Electronic Catalog', href: '#' },
    ],
    supermarkets: [
        { name: 'Our Stores', href: '#' },
        { name: 'Feedback and suggestions', href: '#' },
        { name: 'Partnership', href: '#' },
        { name: 'For Buyers', href: '#' },
        { name: 'Advertising in Market', href: '#' },
    ],
    career: [
        { name: 'Vacancies', href: '#' },
        { name: 'Recruitment Procedure', href: '#' },
        { name: 'Submit CV', href: '#' },
    ],
    social: [
        {
            name: 'Facebook',
            href: '#',
            icon: (props) => (
                <svg fill="currentColor" viewBox="0 0 24 24" {...props}>
                    <path
                        fillRule="evenodd"
                        d="M22 12c0-5.523-4.477-10-10-10S2 6.477 2 12c0 4.991 3.657 9.128 8.438 9.878v-6.987h-2.54V12h2.54V9.797c0-2.506 1.492-3.89 3.777-3.89 1.094 0 2.238.195 2.238.195v2.46h-1.26c-1.243 0-1.63.771-1.63 1.562V12h2.773l-.443 2.89h-2.33v6.988C18.343 21.128 22 16.991 22 12z"
                        clipRule="evenodd"
                    />
                </svg>
            ),
        },
        {
            name: 'Instagram',
            href: '#',
            icon: (props) => (
                <svg fill="currentColor" viewBox="0 0 24 24" {...props}>
                    <path
                        fillRule="evenodd"
                        d="M12.315 2c2.43 0 2.784.013 3.808.06 1.064.049 1.791.218 2.427.465a4.902 4.902 0 011.772 1.153 4.902 4.902 0 011.153 1.772c.247.636.416 1.363.465 2.427.048 1.067.06 1.407.06 4.123v.08c0 2.643-.012 2.987-.06 4.043-.049 1.064-.218 1.791-.465 2.427a4.902 4.902 0 01-1.153 1.772 4.902 4.902 0 01-1.772 1.153c-.636.247-1.363.416-2.427.465-1.067.048-1.407.06-4.123.06h-.08c-2.643 0-2.987-.012-4.043-.06-1.064-.049-1.791-.218-2.427-.465a4.902 4.902 0 01-1.772-1.153 4.902 4.902 0 01-1.153-1.772c-.247-.636-.416-1.363-.465-2.427-.047-1.024-.06-1.379-.06-3.808v-.63c0-2.43.013-2.784.06-3.808.049-1.064.218-1.791.465-2.427a4.902 4.902 0 011.153-1.772A4.902 4.902 0 015.45 2.525c.636-.247 1.363-.416 2.427-.465C8.901 2.013 9.256 2 11.685 2h.63zm-.081 1.802h-.468c-2.456 0-2.784.011-3.807.058-.975.045-1.504.207-1.857.344-.467.182-.8.398-1.15.748-.35.35-.566.683-.748 1.15-.137.353-.3.882-.344 1.857-.047 1.023-.058 1.351-.058 3.807v.468c0 2.456.011 2.784.058 3.807.045.975.207 1.504.344 1.857.182.466.399.8.748 1.15.35.35.683.566 1.15.748.353.137.882.3 1.857.344 1.054.048 1.37.058 4.041.058h.08c2.597 0 2.917-.01 3.96-.058.976-.045 1.505-.207 1.858-.344.466-.182.8-.398 1.15-.748.35-.35.566-.683.748-1.15.137-.353.3-.882.344-1.857.048-1.055.058-1.37.058-4.041v-.08c0-2.597-.01-2.917-.058-3.96-.045-.976-.207-1.505-.344-1.858a3.097 3.097 0 00-.748-1.15 3.098 3.098 0 00-1.15-.748c-.353-.137-.882-.3-1.857-.344-1.023-.047-1.351-.058-3.807-.058zM12 6.865a5.135 5.135 0 110 10.27 5.135 5.135 0 010-10.27zm0 1.802a3.333 3.333 0 100 6.666 3.333 3.333 0 000-6.666zm5.338-3.205a1.2 1.2 0 110 2.4 1.2 1.2 0 010-2.4z"
                        clipRule="evenodd"
                    />
                </svg>
            ),
        },
        {
            name: 'Twitter',
            href: '#',
            icon: (props) => (
                <svg fill="currentColor" viewBox="0 0 24 24" {...props}>
                    <path d="M8.29 20.251c7.547 0 11.675-6.253 11.675-11.675 0-.178 0-.355-.012-.53A8.348 8.348 0 0022 5.92a8.19 8.19 0 01-2.357.646 4.118 4.118 0 001.804-2.27 8.224 8.224 0 01-2.605.996 4.107 4.107 0 00-6.993 3.743 11.65 11.65 0 01-8.457-4.287 4.106 4.106 0 001.27 5.477A4.072 4.072 0 012.8 9.713v.052a4.105 4.105 0 003.292 4.022 4.095 4.095 0 01-1.853.07 4.108 4.108 0 003.834 2.85A8.233 8.233 0 012 18.407a11.616 11.616 0 006.29 1.84" />
                </svg>
            ),
        },
        {
            name: 'GitHub',
            href: '#',
            icon: (props) => (
                <svg fill="currentColor" viewBox="0 0 24 24" {...props}>
                    <path
                        fillRule="evenodd"
                        d="M12 2C6.477 2 2 6.484 2 12.017c0 4.425 2.865 8.18 6.839 9.504.5.092.682-.217.682-.483 0-.237-.008-.868-.013-1.703-2.782.605-3.369-1.343-3.369-1.343-.454-1.158-1.11-1.466-1.11-1.466-.908-.62.069-.608.069-.608 1.003.07 1.531 1.032 1.531 1.032.892 1.53 2.341 1.088 2.91.832.092-.647.35-1.088.636-1.338-2.22-.253-4.555-1.113-4.555-4.951 0-1.093.39-1.988 1.029-2.688-.103-.253-.446-1.272.098-2.65 0 0 .84-.27 2.75 1.026A9.564 9.564 0 0112 6.844c.85.004 1.705.115 2.504.337 1.909-1.296 2.747-1.027 2.747-1.027.546 1.379.202 2.398.1 2.651.64.7 1.028 1.595 1.028 2.688 0 3.848-2.339 4.695-4.566 4.943.359.309.678.92.678 1.855 0 1.338-.012 2.419-.012 2.747 0 .268.18.58.688.482A10.019 10.019 0 0022 12.017C22 6.484 17.522 2 12 2z"
                        clipRule="evenodd"
                    />
                </svg>
            ),
        },
        {
            name: 'YouTube',
            href: '#',
            icon: (props) => (
                <svg fill="currentColor" viewBox="0 0 24 24" {...props}>
                    <path
                        fillRule="evenodd"
                        d="M19.812 5.418c.861.23 1.538.907 1.768 1.768C21.998 8.746 22 12 22 12s0 3.255-.418 4.814a2.504 2.504 0 0 1-1.768 1.768c-1.56.419-7.814.419-7.814.419s-6.255 0-7.814-.419a2.505 2.505 0 0 1-1.768-1.768C2 15.255 2 12 2 12s0-3.255.417-4.814a2.507 2.507 0 0 1 1.768-1.768C5.744 5 11.998 5 11.998 5s6.255 0 7.814.418ZM15.194 12 10 15V9l5.194 3Z"
                        clipRule="evenodd"
                    />
                </svg>
            ),
        },
    ],
}

function Footer() {
    return (
        <footer className="bg-[#43766C]">
            <div className="wrapper px-5">
                <div className='text-[.75em] border-b font-medium border-white/10 text-white flex items-center justify-between text-center py-[50px] gap-[4vw]'>
                    <div className='w-[30%] lg:flex items-center gap-[10px] lg:w-[150px] lg:text-start'>
                        <svg xmlns="http://www.w3.org/2000/svg" className='mx-auto hover:scale-[1.2] transition' width="34.406" height="24.97" viewBox="0 0 34.406 24.97">
                            <defs></defs>
                            <path id="Pulsuz_çatdırılma_50_azn-dən_yuxarı" data-name="Pulsuz çatdırılma 50 azn-dən yuxarı" className="cls-1" d="M49.985,3057.51H40.714a0.61,0.61,0,1,1,0-1.22h8.043v-17.71a1.214,1.214,0,0,0-1.219-1.21H32.447a1.214,1.214,0,0,0-1.22,1.21v17.71h0.829a0.61,0.61,0,1,1,0,1.22H30v-18.93a2.45,2.45,0,0,1,2.448-2.44H47.538a2.45,2.45,0,0,1,2.447,2.44v18.93Zm14.43,0h-3.5a0.61,0.61,0,1,1,0-1.22h2.273v-3.71a2.266,2.266,0,0,0-2.273-2.26h-3.5v-4.93a0.829,0.829,0,0,0-.83-0.83h-6.6v11.73h2.273a0.61,0.61,0,1,1,0,1.22h-3.5v-14.17h7.828a2.057,2.057,0,0,1,2.058,2.05v3.7h2.271a3.5,3.5,0,0,1,3.5,3.49v4.93Zm-7.83,3.6a4.21,4.21,0,1,1,4.221-4.21A4.221,4.221,0,0,1,56.586,3061.11Zm0-7.19a2.985,2.985,0,1,0,2.993,2.98A2.986,2.986,0,0,0,56.586,3053.92Zm-20.2,7.19a4.21,4.21,0,1,1,4.221-4.21A4.221,4.221,0,0,1,36.385,3061.11Zm0-7.19a2.985,2.985,0,1,0,2.993,2.98A2.986,2.986,0,0,0,36.385,3053.92Z" transform="translate(-30 -3036.16)" />
                        </svg>
                        <h4 className='py-[10px]'>
                            Free delivery over 50 azn
                        </h4>
                    </div>
                    <div className='w-[30%] lg:flex items-center gap-[10px] lg:w-[150px] lg:text-start'>
                        <svg xmlns="http://www.w3.org/2000/svg" className='mx-auto hover:scale-[1.2] transition' width="29.5" height="24.91" viewBox="0 0 29.5 24.91">
                            <defs></defs>
                            <path id="Nağd_və_ya_kartla_ödəniş_" data-name="Nağd və ya  kartla ödəniş " className="cls-1" d="M294.984,3059.51H271.632a0.625,0.625,0,0,1,0-1.25h23.352a0.619,0.619,0,0,0,.615-0.62v-6.23a0.615,0.615,0,1,1,1.229,0v6.23A1.86,1.86,0,0,1,294.984,3059.51Zm1.229-12.46a0.621,0.621,0,0,1-.614-0.63v-4.98a0.622,0.622,0,0,0-.615-0.63H271.632a0.613,0.613,0,0,1-.615-0.62,0.619,0.619,0,0,1,.615-0.62h23.352a1.86,1.86,0,0,1,1.844,1.87v4.98A0.621,0.621,0,0,1,296.213,3047.05Zm-27.039,9.97a0.621,0.621,0,0,1-.615-0.63v-16.2a0.615,0.615,0,1,1,1.229,0v16.2A0.62,0.62,0,0,1,269.174,3057.02Zm2.458-16.21a3.115,3.115,0,0,1,0-6.23,0.625,0.625,0,0,1,0,1.25,1.87,1.87,0,0,0,0,3.74,0.619,0.619,0,0,1,.615.62A0.613,0.613,0,0,1,271.632,3040.81Zm-2.458,1.25a0.619,0.619,0,0,1-.615-0.62v-3.74a0.615,0.615,0,1,1,1.229,0v3.74A0.618,0.618,0,0,1,269.174,3042.06Zm23.352-1.25a0.612,0.612,0,0,1-.614-0.62v-3.74a0.619,0.619,0,0,0-.615-0.62H271.632a0.625,0.625,0,0,1,0-1.25H291.3a1.86,1.86,0,0,1,1.844,1.87v3.74A0.613,0.613,0,0,1,292.526,3040.81Zm-20.894,18.7a3.1,3.1,0,0,1-3.073-3.12,0.615,0.615,0,1,1,1.229,0,1.86,1.86,0,0,0,1.844,1.87A0.625,0.625,0,0,1,271.632,3059.51Zm17.207-7.48a3.115,3.115,0,0,1,0-6.23,0.625,0.625,0,0,1,0,1.25,1.865,1.865,0,0,0,0,3.73A0.625,0.625,0,0,1,288.839,3052.03Zm7.374,0h-7.374a0.625,0.625,0,0,1,0-1.25h7.374a0.619,0.619,0,0,0,.615-0.62v-2.49a0.619,0.619,0,0,0-.615-0.62h-7.374a0.625,0.625,0,0,1,0-1.25h7.374a1.86,1.86,0,0,1,1.844,1.87v2.49A1.86,1.86,0,0,1,296.213,3052.03Z" transform="translate(-268.563 -3034.59)" />
                        </svg>
                        <h4 className='py-[10px]'>Payment by cash or card</h4>
                    </div>
                    <div className='w-[30%] lg:flex items-center gap-[10px] lg:w-[100px] lg:text-start'>
                        <svg xmlns="http://www.w3.org/2000/svg" className='mx-auto hover:scale-[1.2] transition' width="29.5" height="29.69" viewBox="0 0 29.5 29.69">
                            <defs></defs>
                            <path id="Hədiyyə_kuponları" data-name="Hədiyyə kuponları" className="cls-1" d="M528.169,3059.73H507.275a1.858,1.858,0,0,1-1.844-1.86v-14.28h24.582v14.28A1.858,1.858,0,0,1,528.169,3059.73Zm-21.508-14.9v13.04a0.619,0.619,0,0,0,.614.62h20.894a0.619,0.619,0,0,0,.615-0.62v-13.04H506.661Zm25.81,0h-29.5v-4.35a1.851,1.851,0,0,1,1.844-1.86h25.81a1.851,1.851,0,0,1,1.844,1.86v4.35Zm-28.269-1.24h27.04v-3.11a0.619,0.619,0,0,0-.615-0.62h-25.81a0.619,0.619,0,0,0-.615.62v3.11Zm12.906-4.3a0.544,0.544,0,0,1-.275-0.07l-5.559-2.8a3.4,3.4,0,0,1-.869-5.41,3.265,3.265,0,0,1,3.21-.89,3.326,3.326,0,0,1,2.375,2.34l1.708,6.04A0.614,0.614,0,0,1,517.108,3039.29Zm-4.341-8.04a2.075,2.075,0,0,0-1.484.63,2.138,2.138,0,0,0,.541,3.42l4.309,2.18-1.324-4.68h0a2.092,2.092,0,0,0-1.5-1.48A1.99,1.99,0,0,0,512.767,3031.25Zm4.648,8.04a0.614,0.614,0,0,1-.591-0.79l1.708-6.04a3.326,3.326,0,0,1,2.376-2.34,3.264,3.264,0,0,1,3.2.88,3.4,3.4,0,0,1-.861,5.42l-5.558,2.8A0.547,0.547,0,0,1,517.415,3039.29Zm4.339-8.04a1.988,1.988,0,0,0-.538.07,2.093,2.093,0,0,0-1.5,1.48h0l-1.323,4.68,4.308-2.18a2.105,2.105,0,0,0,1.142-1.56,2.148,2.148,0,0,0-.592-1.86A2.107,2.107,0,0,0,521.754,3031.25Zm-2.631,1.38h0Zm-1.4,26.48h-1.229v-19.25h1.229v19.25Z" transform="translate(-502.969 -3030.03)" />
                        </svg>
                        <h4 className='py-[10px]'>Gift coupons</h4>
                    </div>
                    <div className=' hidden lg:flex items-center gap-[10px] w-[150px] text-start'>
                        <svg xmlns="http://www.w3.org/2000/svg" className='mx-auto hover:scale-[1.2] transition' width="29.5" height="29.91" viewBox="0 0 29.5 29.91">
                            <defs></defs>
                            <path id="Onlayn_müştəri_xidmətləri" data-name="Onlayn müştəri xidmətləri" className="cls-1" d="M706.376,3057.52h-1.229a5.605,5.605,0,0,1,0-11.21h1.229a0.619,0.619,0,0,1,.615.62v9.97A0.619,0.619,0,0,1,706.376,3057.52Zm-1.229-9.97a4.365,4.365,0,0,0,0,8.73h0.615v-8.73h-0.615Zm18.436,9.97h-1.229a0.618,0.618,0,0,1-.614-0.62v-9.97a0.618,0.618,0,0,1,.614-0.62h1.229A5.605,5.605,0,0,1,723.583,3057.52Zm-0.614-1.24h0.614a4.365,4.365,0,0,0,0-8.73h-0.614v8.73Zm0.614-8.73a0.619,0.619,0,0,1-.614-0.62v-1.87a8.6,8.6,0,1,0-17.207,0v1.87a0.615,0.615,0,1,1-1.229,0v-1.87a9.833,9.833,0,1,1,19.665,0v1.87A0.619,0.619,0,0,1,723.583,3047.55Zm-4.916,14.96a0.625,0.625,0,0,1,0-1.25c3.742,0,4.3-2.73,4.3-4.36a0.615,0.615,0,1,1,1.229,0C724.2,3060.41,722.13,3062.51,718.667,3062.51Zm-1.844,2.49h-2.458a2.49,2.49,0,0,1,0-4.98h2.458A2.49,2.49,0,0,1,716.823,3065Zm-2.458-3.74a1.245,1.245,0,0,0,0,2.49h2.458a1.245,1.245,0,0,0,0-2.49h-2.458Z" transform="translate(-699.625 -3035.09)" />
                        </svg>
                        <h4 className='py-[10px]'>Online customer service</h4>
                    </div>
                    <div className='hidden lg:flex items-center gap-[10px] w-[100px] text-start'>
                        <svg xmlns="http://www.w3.org/2000/svg" className='mx-auto hover:scale-[1.2] transition' width="18.406" height="27.41" viewBox="0 0 18.406 27.41">
                            <defs></defs>
                            <path id="Sürətli_mobil_mağaza" data-name="Sürətli mobil mağaza" className="cls-1" d="M954.234,3060.73H939.368a1.766,1.766,0,0,1-1.767-1.76v-23.9a1.766,1.766,0,0,1,1.767-1.76h14.866a1.765,1.765,0,0,1,1.766,1.76v23.9A1.765,1.765,0,0,1,954.234,3060.73Zm-14.866-26.18a0.519,0.519,0,0,0-.52.52v23.9a0.519,0.519,0,0,0,.52.52h14.866a0.518,0.518,0,0,0,.519-0.52v-23.9a0.518,0.518,0,0,0-.519-0.52H939.368Zm16.008,20.49H938.224a0.62,0.62,0,1,1,0-1.24h17.152A0.62,0.62,0,1,1,955.376,3055.04Zm0-17.08H938.224a0.616,0.616,0,0,1-.623-0.62,0.622,0.622,0,0,1,.623-0.62h17.152a0.623,0.623,0,0,1,.624.62A0.617,0.617,0,0,1,955.376,3037.96Zm-7.432,19.31a1.144,1.144,0,1,1-1.143-1.14A1.139,1.139,0,0,1,947.944,3057.27Z" transform="translate(-937.594 -3033.31)" />
                        </svg>
                        <h4 className='py-[10px]'>Fast mobile store</h4>
                    </div>
                </div>
                <div className="pb-8 pt-10 ">
                    <div className="xl:grid xl:grid-cols-2 xl:gap-10">
                        <div className="grid grid-cols-2 gap-10 xl:col-span-2">
                            <div className="md:grid md:grid-cols-2 md:gap-8">
                                <div>
                                    <h3 className="text-sm font-semibold leading-6 text-white">About</h3>
                                    <ul role="list" className="mt-6 space-y-4">
                                        {navigation.about.map((item) => (
                                            <li key={item.name}>
                                                <a href={item.href} className="text-sm leading-6 text-gray-300 hover:text-white">
                                                    {item.name}
                                                </a>
                                            </li>
                                        ))}
                                    </ul>
                                </div>
                                <div className="mt-10 md:mt-0">
                                    <h3 className="text-sm font-semibold leading-6 text-white">Promotions</h3>
                                    <ul role="list" className="mt-6 space-y-4">
                                        {navigation.promotions.map((item) => (
                                            <li key={item.name}>
                                                <a href={item.href} className="text-sm leading-6 text-gray-300 hover:text-white">
                                                    {item.name}
                                                </a>
                                            </li>
                                        ))}
                                    </ul>
                                </div>
                            </div>
                            <div className="md:grid md:grid-cols-2 md:gap-8">
                                <div>
                                    <h3 className="text-sm font-semibold leading-6 text-white">Supermarkets</h3>
                                    <ul role="list" className="mt-6 space-y-4">
                                        {navigation.supermarkets.map((item) => (
                                            <li key={item.name}>
                                                <a href={item.href} className="text-sm leading-6 text-gray-300 hover:text-white">
                                                    {item.name}
                                                </a>
                                            </li>
                                        ))}
                                    </ul>
                                </div>
                                <div className="mt-10 md:mt-0">
                                    <h3 className="text-sm font-semibold leading-6 text-white">Career</h3>
                                    <ul role="list" className="mt-6 space-y-4">
                                        {navigation.career.map((item) => (
                                            <li key={item.name}>
                                                <a href={item.href} className="text-sm leading-6 text-gray-300 hover:text-white">
                                                    {item.name}
                                                </a>
                                            </li>
                                        ))}
                                    </ul>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div className="mt-16 border-t border-white/10 pt-8 sm:mt-20 md:flex md:items-center md:justify-between">
                        <div className="flex space-x-6 md:order-2">
                            {navigation.social.map((item) => (
                                <a key={item.name} href={item.href} className="text-gray-300 transition-all hover:text-gray-400">
                                    <span className="sr-only">{item.name}</span>
                                    <item.icon className="h-6 w-6" aria-hidden="true" />
                                </a>
                            ))}
                        </div>
                        <p className="mt-8 text-sm leading-5 text-gray-300 md:order-1 md:mt-0">
                            &copy; 2024 GreenShop. All rights reserved.
                        </p>
                    </div>
                </div>
            </div>
        </footer>
    );
}

export default Footer;
